{
  "title": "Nested Types",
  "sections": [
    {
      "heading": "Nested Types in Action",
      "level": 2,
      "content": "The example below defines a structure called BlackjackCard, which models a playing card as used in the game of Blackjack. The BlackjackCard structure contains two nested enumeration types called Suit and Rank.\n\nIn Blackjack, the Ace cards have a value of either one or eleven. This feature is represented by a structure called Values, which is nested within the Rank enumeration:\n\nThe Suit enumeration describes the four common playing card suits, together with a raw Character value to represent their symbol.\n\nThe Rank enumeration describes the thirteen possible playing card ranks, together with a raw Int value to represent their face value. (This raw Int value isn’t used for the Jack, Queen, King, and Ace cards.)\n\nAs mentioned above, the Rank enumeration defines a further nested structure of its own, called Values. This structure encapsulates the fact that most cards have one value, but the Ace card has two values. The Values structure defines two properties to represent this:\n\nfirst, of type Int\n\nsecond, of type Int?, or “optional Int”\n\nRank also defines a computed property, values, which returns an instance of the Values structure. This computed property considers the rank of the card and initializes a new Values instance with appropriate values based on its rank. It uses special values for jack, queen, king, and ace. For the numeric cards, it uses the rank’s raw Int value.\n\nThe BlackjackCard structure itself has two properties — rank and suit. It also defines a computed property called description, which uses the values stored in rank and suit to build a description of the name and value of the card. The description property uses optional binding to check whether there’s a second value to display, and if so, inserts additional description detail for that second value.\n\nBecause BlackjackCard is a structure with no custom initializers, it has an implicit memberwise initializer, as described in Memberwise Initializers for Structure Types. You can use this initializer to initialize a new constant called theAceOfSpades:\n\nEven though Rank and Suit are nested within BlackjackCard, their type can be inferred from context, and so the initialization of this instance is able to refer to the enumeration cases by their case names (.ace and .spades) alone. In the example above, the description property correctly reports that the Ace of Spades has a value of 1 or 11.\n\n",
      "codeExamples": []
    },
    {
      "heading": "Referring to Nested Types",
      "level": 2,
      "content": "To use a nested type outside of its definition context, prefix its name with the name of the type it’s nested within:\n\nFor the example above, this enables the names of Suit, Rank, and Values to be kept deliberately short, because their names are naturally qualified by the context in which they’re defined.\n\n",
      "codeExamples": []
    }
  ]
}